Unix/tests/protocol/posthttp/test3.request.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd">
<s:Header>
<a:To>
https://157.59.84.237:7779/wsman</a:To>
<w:ResourceURI s:mustUnderstand="true">
http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/TestClass_AllDMTFTypes</w:ResourceURI>
<a:ReplyTo>
<a:Address s:mustUnderstand="true">
http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
</a:ReplyTo>
<a:Action s:mustUnderstand="true">
http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/TestClass_AllDMTFTypes/GetBoolValue</a:Action>
<w:MaxEnvelopeSize s:mustUnderstand="true">
512000</w:MaxEnvelopeSize>
<a:MessageID>
uuid:11684999-5F8C-487F-8CE7-5B109837F710</a:MessageID>
<w:Locale xml:lang="en-US" s:mustUnderstand="false" />
<p:DataLocale xml:lang="en-US" s:mustUnderstand="false" />
<p:ActivityId s:mustUnderstand="false">
DEE76A48-606F-0001-F32F-EBDE6F60CD01</p:ActivityId>
<p:SessionId s:mustUnderstand="false">
uuid:1F734FA4-F2E5-4B59-8517-4326F748204A</p:SessionId>
<p:OperationID s:mustUnderstand="false">
uuid:4A6E8B13-E127-4048-8FE8-60347BA49E0D</p:OperationID>
<p:SequenceId s:mustUnderstand="false">
1</p:SequenceId>
<w:SelectorSet>
<w:Selector Name="__cimnamespace">
root/omi</w:Selector>
<w:Selector Name="v_Key">
0</w:Selector>
</w:SelectorSet>
<w:OptionSet xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">
0</w:Option>
<w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">
1</w:Option>
<w:Option Name="wmiarray:__MI_OPERATIONOPTIONS_CHANNELVALUE" Type="xs:unsignedInt">
2</w:Option>
<w:Option Name="msftwinrm:UsePreciseArrays" Type="xs:boolean">
true</w:Option>
</w:OptionSet>
</s:Header>
<s:Body>
<p0:GetBoolValue_INPUT xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:p0="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/TestClass_AllDMTFTypes" xsi:type="GetBoolValue_INPUT_Type">
</p0:GetBoolValue_INPUT>
</s:Body>
</s:Envelope>

